app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    puts product_params
    respond_to do |format|
      if @product.save
---
INSERT INTO `products` (`created_at`, `description`, `name`, `price`, `updated_at`) VALUES ('2014-06-30 00:43:56', 'Vestido Azul', 'Vestido Azul Blue Jeans', 19990, '2014-06-30 00:43:56')

    def set_store
      @store = Store.find(params[:store_id])
---
SELECT `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1