app/controllers/stores_controller.rb

SELECT `stores`.* FROM `stores`
---
  def index
    @stores = Store.all

INSERT INTO `stores` (`address`, `created_at`, `logo_content_type`, `logo_file_name`, `logo_file_size`, `logo_updated_at`, `name`, `updated_at`) VALUES ('Carrera 13A # 89-13', '2014-06-29 01:11:02', 'image/jpeg', '05_funkrush.jpg', 36016, '2014-06-29 01:11:02', 'Ejemplo de Tienda', '2014-06-29 01:11:02')
---
  def create
    @store = Store.new(store_params)

    respond_to do |format|
      if @store.save

SELECT `stores`.* FROM `stores` WHERE `stores`.`id` = 1 LIMIT 1
---
    def set_store
      @store = Store.find(params[:id])