app/views/products/_product_categories.html.erb

SELECT `product_categories`.* FROM `product_categories`
---
	  <div class="controls">
<% ProductCategory.all.each_with_index do |pc, i| %>