app/views/products/show.html.erb

SELECT COUNT(*) FROM `product_stock_sizes` WHERE `product_stock_sizes`.`product_id` = 1
SELECT `product_stock_sizes`.* FROM `product_stock_sizes` WHERE `product_stock_sizes`.`product_id` = 1
---
<div class="well">
<% if @product.product_stock_sizes.size > 0 %>

SELECT COUNT(*) FROM `product_images` WHERE `product_images`.`product_id` = 1
SELECT `product_images`.* FROM `product_images` WHERE `product_images`.`product_id` = 1
---
<div class="well">
<% if @product.product_images.size > 0 %>